test/unit/channels1x2x2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GKOCG;
        tolerance       0;
        relTol          0.1;
        verbose         1;
        executor        reference;
        forceHostBuffer 0;
        preconditioner  none;
    }

    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|k|nuTilda)"
    {
        solver          PBiCGStab;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
        forceHostBuffer 1;
        executor        hip;
        preconditioner  DILU;
    }

    "(U|k|nuTilda)Final"
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        10;
    pRefValue       0;
}


// ************************************************************************* //
